Mi-Bee-Studio/seeed-esp32s3-cam/sdkconfig.defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# PSRAM (8MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# Run Octal PSRAM at 80MHz (up from default 40MHz) for ~2x memcpy bandwidth.
# Octal DDR mode requires 64B cache line (set below); 80MHz is supported by the ESP32-S3 PSRAM controller.
CONFIG_SPIRAM_SPEED_80M=y

# Cache line size MUST be 64B for Octal PSRAM DDR mode (32B causes data corruption)
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Flash 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Camera (XIAO ESP32S3 Sense pin mapping)
CONFIG_CAMERA_PIN_PWDN=-1
CONFIG_CAMERA_PIN_RESET=-1
CONFIG_CAMERA_PIN_XCLK=10
CONFIG_CAMERA_PIN_SIOD=40
CONFIG_CAMERA_PIN_SIOC=39
CONFIG_CAMERA_PIN_D7=48
CONFIG_CAMERA_PIN_D6=11
CONFIG_CAMERA_PIN_D5=12
CONFIG_CAMERA_PIN_D4=14
CONFIG_CAMERA_PIN_D3=16
CONFIG_CAMERA_PIN_D2=18
CONFIG_CAMERA_PIN_D1=17
CONFIG_CAMERA_PIN_D0=15
CONFIG_CAMERA_PIN_VSYNC=38
CONFIG_CAMERA_PIN_HREF=47
CONFIG_CAMERA_PIN_PCLK=13

CONFIG_CAMERA_PSRAM_DMA=n
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=524288

# I2S PDM Microphone (XIAO ESP32-S3 Sense onboard MEMS mic)
CONFIG_I2S_PDM_RX_GPIO_CLK=42
CONFIG_I2S_PDM_RX_GPIO_DATA=41

# SD card: currently uses SDSPI mode (see main/storage_manager.c).
# SDMMC 1-bit mode would free GPIO10 for camera XCLK, but requires the SDMMC
# host driver + CMD pin wiring verification. Tracked as a future optimization.
# (CONFIG_SD_MMC_1_LINE_MODE was removed: not a real ESP-IDF v6.0 Kconfig symbol.)

# FatFS
CONFIG_FATFS_FS_LOCK=10
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=n

# WiFi
# AMPDU aggregation significantly improves MJPEG/RTSP streaming throughput by
# allowing multiple frames per TXOP. Was disabled (legacy default); re-enabled.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
# LWIP
CONFIG_LWIP_MAX_SOCKETS=24
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_COLORS=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
CONFIG_FREERTOS_DEFAULT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_SPIFFS=y

# WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y
# IDF v6 起握手不再进 uri handler，客户端入册依赖握手后回调（ws_server.c）
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y

# System event task stack (increased for mDNS init in wifi event handler)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# TCP/LWIP tuning; MAXRTX=12 for weak WiFi (keep MSS=1440).
# 2026-09-03: 16KB 窗口 × 本板实测 RTT~250ms(ch11 拥塞) 把每条流钳在 ~64KB/s(<1fps@55KB),
# 用户观感"推流没有内容"。SND_BUF 48KB → 单流 ~190KB/s(~3.4fps)；WND 32KB 兼顾 OTA 上行。
# 大缓冲经 SPIRAM_USE_MALLOC 走 PSRAM（>16KB 分配），不挤内部 RAM。
CONFIG_LWIP_TCP_RTO_TIME=1500
CONFIG_LWIP_TCP_RECVMBOX_SIZE=24
CONFIG_LWIP_TCP_MAXRTX=12

# WiFi roaming (ESP-IDF built-in roaming app, v5.4+)
CONFIG_ESP_WIFI_ENABLE_ROAMING_APP=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_ROAMING=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_THRESHOLD=-75
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_OFFSET=10
CONFIG_ESP_WIFI_ROAMING_PERIODIC_SCAN_MONITOR=y

# OTA rollback support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y
# TIME_WAIT = 2xMSL; 15s MSL keeps dead uploads from starving httpd of sockets (2026-09-02 EMFILE incident)
CONFIG_LWIP_TCP_MSL=15000

# WiFi/lwIP 缓冲迁入 PSRAM（2026-09-02 内部 RAM 枯竭事故）：
# MJPEG LRU 修复后并发连接增多（httpd 8 + mjpeg 3 + rtsp/ws/上传），
# 内部 DRAM 只剩 ~13KB → SD DMA 分配失败、MJPEG 客户端任务栈分配失败。
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ESPectre CSI 运动感知（2026-09-06 试点，PIT-034）：ch11 拥塞网实测
# admitted 只有 ~7-10pps，时间栅格 pps 必须匹配链路供给——100/20pps 都过不了
# 检测器 70% 槽占用下限，校准永不完成。换不拥塞的网/信道可回调（上限 500）。
CONFIG_ESPECTRE_CSI_TARGET_PPS=10
